### 1 ) Importing Libraries

In [1]:
import pandas as pd

C:\Users\yasha\anaconda3\lib\site-packages\numpy\_distributor_init.py:30: UserWarning: loaded more than 1 DLL from .libs:
C:\Users\yasha\anaconda3\lib\site-packages\numpy\.libs\libopenblas.EL2C6PLE4ZYW3ECEVIV3OXXGRN2NRFM2.gfortran-win_amd64.dll
C:\Users\yasha\anaconda3\lib\site-packages\numpy\.libs\libopenblas.WCDJNK7YVMPZQ2ME2ZZHJJRJ3JIKNDB7.gfortran-win_amd64.dll
  warnings.warn("loaded more than 1 DLL from .libs:"

### 2 ) Preparing dataset

In [2]:
movie = pd.read_csv('movie.csv')
rating = pd.read_csv('rating.csv')
#link = pd.read_csv('link.csv')

In [ ]:
movie

In [ ]:
rating

In [ ]:
link

#### Merging movie and rating datasets on movieId

In [3]:
df = movie.merge(rating, how = "left", on = "movieId")

In [ ]:
df

In [ ]:
df.shape

In [4]:
#counting how many time the movie is rated
count = pd.DataFrame(df["title"].value_counts())
count

                                     title
Pulp Fiction (1994)                  67310
Forrest Gump (1994)                  66172
Shawshank Redemption, The (1994)     63366
Silence of the Lambs, The (1991)     63299
Jurassic Park (1993)                 59715
...                                    ...
Doubting Thomas (1935)                   1
Three Faces East (1930)                  1
To Grandmother's House We Go (1992)      1
Protector (Protektor) (2009)             1
The Sweet Ride (1968)                    1

[27262 rows x 1 columns]

Here we can see some movies are rated only by a few users and hence we can conclude that these movies are not so popular (or) are rare and therefore we are eliminating those movies which are rated by less 10000 users.

In [5]:
#movies rated by 10000 or more users
final_movies = df[df["title"].isin(count[count["title"] >= 15000].index)]

In [ ]:
final_movies

In [6]:
#creating a dataframe of movies title and users with their ratings
df_movie_user = final_movies.pivot_table(index="userId", columns="title", values="rating")

In [ ]:
df_movie_user

#selecting a random user
user = int(pd.Series(df_movie_user.index).sample(1, random_state = 42).values)
user

### 3 ) Determination of Films watched by the user

user_df = df_movie_user[df_movie_user.index == 1145]

user_df

#movies watched by the user
movies_watched = user_df.columns[user_df.notna().any()].tolist()
movies_watched

user_df[movies_watched]

In [ ]:
final_df = movies_watched_df[movies_watched_df.index.isin(users_same_movies)]

#checking user's score on a movie
df_movie_user.loc[df_movie_user.index == user, df_movie_user.columns == 'Wag the Dog (1997)']

#total number of movies watched by the user
len(movies_watched)

movie["title"].str.find('Primer (2004)')

In [7]:
new_movies = pd.Series(['Fight Club (1999)',
             #'Primer (2004)',
             #'Ratatouille (2007)',
             'Lord of the Rings: The Fellowship of the Ring, The (2001)',
             'Apollo 13 (1995)'])

In [8]:
new_movies

0                                    Fight Club (1999)
1    Lord of the Rings: The Fellowship of the Ring,...
2                                     Apollo 13 (1995)
dtype: object

### 4 ) Accessing the Data and IDs of Other Users Watching the Same Movies

In [9]:
#creating a dataframe of movies watched by the user
movies_watched_df = df_movie_user[new_movies]
movies_watched_df

title,Fight Club (1999),"Lord of the Rings: The Fellowship of the Ring, The (2001)",Apollo 13 (1995)
userId,,,
1.0,4.0,5.0,NaN
2.0,NaN,NaN,NaN
3.0,NaN,NaN,NaN
4.0,NaN,NaN,NaN
5.0,NaN,NaN,5.0
...,...,...,...
138489.0,4.5,NaN,NaN
138490.0,NaN,NaN,4.0
138491.0,NaN,NaN,NaN
138492.0,NaN,NaN,NaN
138493.0,5.0,4.0,4.5

There are only those movies that were rated by the user

In [10]:
# Number of other users who gave vote for the movies selected by the user
user_movie_count = movies_watched_df.T.notnull().sum()

In [11]:
user_movie_count = user_movie_count.reset_index()

In [12]:
user_movie_count.columns = ['userId', 'movie_count']

In [13]:
user_movie_count

          userId  movie_count
0            1.0            2
1            2.0            0
2            3.0            0
3            4.0            0
4            5.0            1
...          ...          ...
136381  138489.0            1
136382  138490.0            1
136383  138491.0            0
136384  138492.0            0
136385  138493.0            3

[136386 rows x 2 columns]

In [16]:
#selecting users that watched atleast 80% of the movies that user watched
percentage = len(new_movies)* 80/100
user_movie_count[user_movie_count["movie_count"] > percentage].sort_values("movie_count", ascending=False)

          userId  movie_count
10          11.0            3
89987    91420.0            3
89885    91317.0            3
89891    91323.0            3
89917    91349.0            3
...          ...          ...
44361    45071.0            3
44365    45075.0            3
44376    45088.0            3
44384    45096.0            3
136385  138493.0            3

[11806 rows x 2 columns]

In [17]:
#Number of people who watches all the same movies that user watched
user_movie_count[user_movie_count["movie_count"] == 3].count()

userId         11806
movie_count    11806
dtype: int64

We can see that 57 users watched all the same movies that user watched

In [18]:
# Taking user IDs of those users who watched more than 60% of the same movies
users_same_movies = user_movie_count[user_movie_count["movie_count"] > percentage]["userId"]

In [19]:
users_same_movies

10            11.0
90            91.0
115          116.0
123          124.0
130          131.0
            ...
136311    138419.0
136314    138422.0
136348    138456.0
136366    138474.0
136385    138493.0
Name: userId, Length: 11806, dtype: float64

In [20]:
new_movies_df = pd.DataFrame({'new_movies':new_movies.index})

In [21]:
new_movies_df

                                          new_movies
0                                  Fight Club (1999)
1  Lord of the Rings: The Fellowship of the Ring,...
2                                   Apollo 13 (1995)

### Identifying the Users with Most Similar Behavior to The User to Be Recommended

#collecting data of our user and other users
final_df = pd.concat([movies_watched_df[movies_watched_df.index.isin(users_same_movies)],
                      new_movies_df[new_movies]])

In [31]:
#Finding the correlation
final_df.T.corr()

userId,11.0,91.0,116.0,124.0,131.0,152.0,156.0,208.0,211.0,220.0,...,138387.0,138392.0,138397.0,138411.0,138416.0,138419.0,138422.0,138456.0,138474.0,138493.0
userId,,,,,,,,,,,,,,,,,,,,,
11.0,1.000000,-0.500000,-0.970725,-0.693375,-0.500000,-0.944911,NaN,0.500000,0.500000,-0.500000,...,-0.755929,0.500000,0.866025,0.000000,-0.500000,0.000000,NaN,0.866025,NaN,-0.866025
91.0,-0.500000,1.000000,0.693375,-0.277350,1.000000,0.755929,NaN,-1.000000,0.500000,-0.500000,...,0.944911,0.500000,-0.866025,0.866025,1.000000,0.866025,NaN,-0.866025,NaN,0.000000
116.0,-0.970725,0.693375,1.000000,0.500000,0.693375,0.995871,NaN,-0.693375,-0.277350,0.277350,...,0.891042,-0.277350,-0.960769,0.240192,0.693375,0.240192,NaN,-0.960769,NaN,0.720577
124.0,-0.693375,-0.277350,0.500000,1.000000,-0.277350,0.419314,NaN,0.277350,-0.970725,0.970725,...,0.052414,-0.970725,-0.240192,-0.720577,-0.277350,-0.720577,NaN,-0.240192,NaN,0.960769
131.0,-0.500000,1.000000,0.693375,-0.277350,1.000000,0.755929,NaN,-1.000000,0.500000,-0.500000,...,0.944911,0.500000,-0.866025,0.866025,1.000000,0.866025,NaN,-0.866025,NaN,0.000000
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
138419.0,0.000000,0.866025,0.240192,-0.720577,0.866025,0.327327,NaN,-0.866025,0.866025,-0.866025,...,0.654654,0.866025,-0.500000,1.000000,0.866025,1.000000,NaN,-0.500000,NaN,-0.500000
138422.0,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
138456.0,0.866025,-0.866025,-0.960769,-0.240192,-0.866025,-0.981981,NaN,0.866025,0.000000,0.000000,...,-0.981981,0.000000,1.000000,-0.500000,-0.866025,-0.500000,NaN,1.000000,NaN,-0.500000
138474.0,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
138493.0,-0.866025,0.000000,0.720577,0.960769,0.000000,0.654654,NaN,0.000000,-0.866025,0.866025,...,0.327327,-0.866025,-0.500000,-0.500000,0.000000,-0.500000,NaN,-0.500000,NaN,1.000000

In [32]:
#creating a correlation dataframe
corr_df = final_df.T.corr().unstack().sort_values().drop_duplicates()
corr_df = pd.DataFrame(corr_df, columns=["corr"])
corr_df.index.names = ['user_id_1', 'user_id_2']
corr_df = corr_df.reset_index()

In [33]:
corr_df

      user_id_1  user_id_2  corr
0       26240.0    41818.0  -1.0
1       33724.0   113898.0  -1.0
2      128147.0    65368.0  -1.0
3       14561.0    72949.0  -1.0
4       21746.0    22071.0  -1.0
...         ...        ...   ...
3983   131829.0   126429.0   1.0
3984    41372.0    80207.0   1.0
3985   107234.0    11677.0   1.0
3986    59424.0    80361.0   1.0
3987       11.0      156.0   NaN

[3988 rows x 3 columns]

In [45]:
#find the users which are highly correlated 
top_users = corr_df[(corr_df["user_id_1"] == random_user) & (corr_df["corr"] >= 0.65)][["user_id_2", "corr"]].reset_index(drop=True)

In [46]:
top_users = top_users.sort_values(by='corr', ascending=False)

In [47]:
top_users

Empty DataFrame
Columns: [user_id_2, corr]
Index: []

In [38]:
top_users.rename(columns={"user_id_2": "userId"}, inplace=True)
top_users

Empty DataFrame
Columns: [userId, corr]
Index: []

In [ ]:
top_users_rating = top_users.merge(rating[["userId", "movieId", "rating"]], how = "inner")
top_users_rating

In [ ]:
top_users_rating = top_users_rating[top_users_rating["userId"] != random_user]
top_users_rating

### Calculating the Weighted Average Recommendation Score

In [ ]:
top_users_rating['weighted_rating'] = top_users_rating['corr']*top_users_rating['rating']
top_users_rating

In [ ]:
#total recommended movies
recommendation_df = top_users_rating.groupby('movieId').agg({"weighted_rating": "mean"})
recommendation_df = recommendation_df.reset_index()

In [ ]:
recommendation_df

In [ ]:
recommendation_df[["movieId"]].nunique()

Choosing the movies with highest weighted average to suggest

In [ ]:
recommendation_df[recommendation_df["weighted_rating"] > 4]

In [ ]:
movies_to_recommend = recommendation_df[recommendation_df["weighted_rating"] > 4].sort_values("weighted_rating", ascending = False)

In [ ]:
movies_to_recommend

In [ ]:
recommendation = movies_to_recommend.merge(movie[["movieId", "title"]])

In [ ]:
recommendation